In [46]:
import pandas as pd
dt=pd.read_excel('Groups.xlsx')
dt

   Group A  Group B  Group C
0       23       19       14
1       21       21       13
2       19       25       31
3       23       29       23
4       23       28       26
5       22       30       29
6       26       24       21

In [47]:

dt.head()

   Group A  Group B  Group C
0       23       19       14
1       21       21       13
2       19       25       31
3       23       29       23
4       23       28       26

In [48]:
dt.head(2)

   Group A  Group B  Group C
0       23       19       14
1       21       21       13

In [49]:
dt.tail(3)

   Group A  Group B  Group C
4       23       28       26
5       22       30       29
6       26       24       21

In [50]:
dt.shape

(7, 3)

In [51]:
dt.columns

Index(['Group A', 'Group B', 'Group C'], dtype='object')

In [52]:
dt.dtypes

Group A    int64
Group B    int64
Group C    int64
dtype: object

In [53]:
dt.info(0)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Group A  7 non-null      int64
 1   Group B  7 non-null      int64
 2   Group C  7 non-null      int64
dtypes: int64(3)
memory usage: 296.0 bytes

In [54]:
dt['Group A']

0    23
1    21
2    19
3    23
4    23
5    22
6    26
Name: Group A, dtype: int64

In [55]:
dt[['Group A']]

   Group A
0       23
1       21
2       19
3       23
4       23
5       22
6       26

In [56]:
dt.sample(2)

   Group A  Group B  Group C
6       26       24       21
5       22       30       29

In [57]:
dt.sample(2)

   Group A  Group B  Group C
1       21       21       13
5       22       30       29

In [58]:
dt.sample(3)

   Group A  Group B  Group C
3       23       29       23
1       21       21       13
0       23       19       14

In [59]:
dt[['Group A']].head(2)

   Group A
0       23
1       21

In [60]:
dt[['Group C']].tail(2)

   Group C
5       29
6       21

In [61]:
dt[2:7]

   Group A  Group B  Group C
2       19       25       31
3       23       29       23
4       23       28       26
5       22       30       29
6       26       24       21

In [62]:
dt[2:5]

   Group A  Group B  Group C
2       19       25       31
3       23       29       23
4       23       28       26

In [63]:
dt[-2:]

   Group A  Group B  Group C
5       22       30       29
6       26       24       21

In [64]:
dt[-3:]

   Group A  Group B  Group C
4       23       28       26
5       22       30       29
6       26       24       21